clusterMHDTest/ShockTUBE-Ryu/256/1a/HLLC-L/0/Ma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Ma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
255
(
7.74597
7.74597
7.74597
7.74597
7.74597
7.74597
7.74597
7.74597
...
)
;

boundaryField
{
    front-back
    {
        type            empty;
    }
    inlet-outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 2(1.73205 7.74597);
    }
    top-down
    {
        type            empty;
    }
}


// ************************************************************************* //
