clusterMHDTest/ShockTUBE-Ryu/256/1a/HLLC-L/constant/polyMesh/boundary
FoamFile
{
    version     2.0;
    format      ascii;
    location    "constant/polyMesh";
    class       polyBoundaryMesh;
    object      boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    front-back
    {
        type empty;
        nFaces 510;
        startFace 254;
    }
    inlet-outlet
    {
        type patch;
        nFaces 2;
        startFace 764;
    }
    top-down
    {
        type empty;
        nFaces 510;
        startFace 766;
    }
)


// ************************************************************************* //
